const ZODIAC_SIGNS = [
    "Овен ♈", "Телец ♉", "Близнецы ♊", "Рак ♋", "Лев ♌", "Дева ♍",
    "Весы ♎", "Скорпион ♏", "Стрелец ♐", "Козерог ♑", "Водолей ♒", "Рыбы ♓"
];

const PLANET_NAMES = {
    0: "Солнце ☀️", 1: "Луна 🌙", 2: "Меркурий ☿", 3: "Венера ♀", 4: "Марс ♂",
    5: "Юпитер ♃", 6: "Сатурн ♄", 7: "Уран ♅", 8: "Нептун ♆", 9: "Плутон ♇",
    10: "Раху ☊", 12: "Лилит ⚓"
};

const ASPECT_NAMES = {
    0: "Соединение ☌", 72: "Квинтиль ▰", 90: "Квадрат ▢", 120: "Трин △", 180: "Оппозиция ☍"
};

const ZODIAC_PROPERTIES = [
    { element: "Огонь 🔥", cross: "Кардинальный" },    // 0 Овен
    { element: "Земля ⛰️", cross: "Фиксированный" },  // 1 Телец
    { element: "Воздух 💨", cross: "Мутабельный" },   // 2 Близнецы
    { element: "Вода 💧", cross: "Кардинальный" },     // 3 Рак
    { element: "Огонь 🔥", cross: "Фиксированный" },    // 4 Лев
    { element: "Земля ⛰️", cross: "Мутабельный" },   // 5 Дева
    { element: "Воздух 💨", cross: "Кардинальный" },   // 6 Весы
    { element: "Вода 💧", cross: "Фиксированный" },    // 7 Скорпион
    { element: "Огонь 🔥", cross: "Мутабельный" },     // 8 Стрелец
    { element: "Земля ⛰️", cross: "Кардинальный" },    // 9 Козерог
    { element: "Воздух 💨", cross: "Фиксированный" },  // 10 Водолей
    { element: "Вода 💧", cross: "Мутабельный" }       // 11 Рыбы
];

const BASE_PLANET_WEIGHTS = {
    0: 2, 1: 2, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1
};
